#+TITLE: Artur Taranchiev's Emacs configuration
#+OPTIONS: toc:4 h:4

**** Getting Helm and org-refile to clock in or create tasks :emacs:org:helm:
  :PROPERTIES:
  :Effort:   1:00
  :ID:       o2b:68856129-3324-4a07-87f3-066a228c5847
  :POSTID:   27940
  :BLOG:     sacha
  :END:
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2015-02-02 Mon 08:40]
   CLOCK: [2015-02-02 Mon 08:35]--[2015-02-02 Mon 08:40] =>  0:05
   CLOCK: [2015-02-02 Mon 07:13]--[2015-02-02 Mon 08:35] =>  1:22
   :END:

I've been thinking about how to improve the way that I navigate to,
clock in, and create tasks in Org Mode. If the task is one of the ones
I've planned for today, I use my Org agenda. If I know that the task
exists, I use =C-u C-c C-w= (=org-refile=) to jump to it, and then =!=
(one of my =org-speed-commands-user= options) to clock in and track it
on Quantified Awesome. If I want to resume an interrupted task, I use
=C-u C-c j= (my shortcut for =org-clock-goto=). For new tasks, I go to
the appropriate project entry and create it, although I really should
be using =org-capture= instead.

[[https://www.flickr.com/photos/65214961@N00/16218018829][2015-01-30 Org Mode jumping to tasks -- index card #emacs #org]]

I thought about how I can reduce some of these distinctions. For
example, what if it didn't matter whether or not a task already
exists? I can modify the org-refile interface to make it easier for me
to create tasks if my description doesn't match anything. To make
things simpler, I'll just reuse one of my =org-capture-templates=, and
I'll pre-fill it with the candidate from Helm.

#+BEGIN_SRC emacs-lisp :tangle yes
  (ert-deftest my/org-capture-prefill-template ()
    (should
     ;; It should fill things in one field at ia time
     (string=
      (my/org-capture-prefill-template
       "* TODO %^{Task}\nSCHEDULED: %^t\n:PROPERTIES:\n:Effort: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}\n:END:\n%?\n"
       "Hello World")
      "* TODO Hello World\nSCHEDULED: %^t\n:PROPERTIES:\n:Effort: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}\n:END:\n%?\n"
      ))
    (should
     (string=
      (my/org-capture-prefill-template
       "* TODO %^{Task}\nSCHEDULED: %^t\n:PROPERTIES:\n:Effort: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}\n:END:\n%?\n"
       "Hello World" "<2015-01-01>")
      "* TODO Hello World\nSCHEDULED: <2015-01-01>\n:PROPERTIES:\n:Effort: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}\n:END:\n%?\n"))
    (should
     (string=
      (my/org-capture-prefill-template
       "* TODO %^{Task}\nSCHEDULED: %^t\n:PROPERTIES:\n:Effort: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}\n:END:\n%?\n"
       "Hello World" "<2015-01-01>" "0:05")
      "* TODO Hello World\nSCHEDULED: <2015-01-01>\n:PROPERTIES:\n:Effort: 0:05\n:END:\n%?\n")))

  (defun my/org-capture-prefill-template (template &rest values)
    "Pre-fill TEMPLATE with VALUES."
    (setq template (or template (org-capture-get :template)))
    (with-temp-buffer
      (insert template)
      (goto-char (point-min))
      (while (re-search-forward
              (concat "%\\("
                      "\\[\\(.+\\)\\]\\|"
                      "<\\([^>\n]+\\)>\\|"
                      "\\([tTuUaliAcxkKInfF]\\)\\|"
                      "\\(:[-a-zA-Z]+\\)\\|"
                      "\\^\\({\\([^}]*\\)}\\)"
                      "?\\([gGtTuUCLp]\\)?\\|"
                      "%\\\\\\([1-9][0-9]*\\)"
                      "\\)") nil t)
        (if (car values)
            (replace-match (car values) nil t))
        (setq values (cdr values)))
      (buffer-string)))

  (defun my/org-get-current-refile-location ()
    "Return the current entry as a location understood by org-refile."
    (interactive)
    (list (elt (org-heading-components) 4)
          (or buffer-file-name
              (with-current-buffer (buffer-base-buffer (current-buffer))
                buffer-file-name))
          nil
          (point)))

  (defun my/helm-org-create-task (candidate)
    "Creates the task and returns the location."
    (let ((entry (org-capture-select-template "T")))
      (org-capture-set-plist entry)
      (org-capture-get-template)
      (org-capture-set-target-location)
      (condition-case error
          (progn
            (org-capture-put
             :template
             (org-capture-fill-template
              (my/org-capture-prefill-template (org-capture-get :template)
                                               candidate)))
            (org-capture-place-template
             (equal (car (org-capture-get :target)) 'function))
            (setq org-refile-target-table (org-refile-get-targets))
            ;; Return the new location
            (my/org-get-current-refile-location))
        ((error quit)
         (if (get-buffer "*Capture*") (kill-buffer "*Capture*"))
         (error "Capture abort: %s" error)))))

  ;; (my/org-refile-get-location-by-substring "Try again")
#+END_SRC
  
Next, I want to add this to the way that Helm prompts me to refile.
That means that my creation task should return something ready for
=org-refile=. Actually, maybe I don't have to do that if I know I'm
always going to call it when I want to jump to something. I might as
well add that bit of code that sets up clocking in, too.

#+BEGIN_SRC emacs-lisp :tangle yes
    (defvar my/helm-org-refile-locations nil)
    (defvar my/org-refile-last-location nil)

    (defun my/helm-org-clock-in-and-track-from-refile (candidate)
      (let ((location (org-refile--get-location candidate my/helm-org-refile-locations)))
        (save-window-excursion
          (org-refile 4 nil location)
          (my/org-clock-in-and-track)
          t)))

  (defun my/org-get-todays-items-as-refile-candidates ()
    "Return items scheduled for today, ready for choosing during refiling."
    (delq
     nil
     (mapcar
      (lambda (s)
        (if (get-text-property 0 'org-marker s)
            (list
             s
             (buffer-file-name (marker-buffer (get-text-property 0 'org-marker s)))
             nil
             (marker-position (get-text-property 0 'org-marker s)))))
      (save-window-excursion (my/org-get-entries-fn (calendar-current-date) (calendar-current-date))))))

  ;; Based on http://emacs.stackexchange.com/questions/4063/how-to-get-the-raw-data-for-an-org-mode-agenda-without-an-agenda-view
  (defun my/org-get-entries-fn (begin end)
  "Return org schedule items between BEGIN and END.
  USAGE:  (org-get-entries-fn '(6 1 2015) '(6 30 2015))"
    (require 'calendar)
    (require 'org)
    (require 'org-agenda)
    (require 'cl)
    (unless
        (and
          (calendar-date-is-valid-p begin)
          (calendar-date-is-valid-p end))
      (let ((debug-on-quit nil))
        (signal 'quit `("One or both of your gregorian dates are invalid."))))
    (let* (
        result
        (org-agenda-prefix-format "  • ")
        (org-agenda-entry-types '(:scheduled))
        (date-after
          (lambda (date num)
            "Return the date after NUM days from DATE."
            (calendar-gregorian-from-absolute
             (+ (calendar-absolute-from-gregorian date) num))))
        (enumerate-days
          (lambda (begin end)
            "Enumerate date objects between BEGIN and END."
            (when (> (calendar-absolute-from-gregorian begin)
                     (calendar-absolute-from-gregorian end))
              (error "Invalid period : %S - %S" begin end))
            (let ((d begin) ret (cont t))
              (while cont
                (push (copy-sequence d) ret)
                (setq cont (not (equal d end)))
                (setq d (funcall date-after d 1)))
              (nreverse ret)))) )
      (org-agenda-reset-markers)
      (setq org-agenda-buffer
        (when (buffer-live-p org-agenda-buffer)
          org-agenda-buffer))
      (org-compile-prefix-format nil)
      (setq result
        (loop for date in (funcall enumerate-days begin end) append
          (loop for file in (org-agenda-files nil 'ifmode)
            append
            (progn
              (org-check-agenda-file file)
              (apply 'org-agenda-get-day-entries file date org-agenda-entry-types)))))
      (unless (buffer-live-p (get-buffer org-agenda-buffer-name))
        (get-buffer-create org-agenda-buffer-name))
      (with-current-buffer (get-buffer org-agenda-buffer-name)
        (org-agenda-mode)
        (setq buffer-read-only t)
        (let ((inhibit-read-only t))
          (erase-buffer))
        (mapcar
          (lambda (x)
            (let ((inhibit-read-only t))
              (insert (format "%s" x) "\n")))
          result))
  ;;    (display-buffer org-agenda-buffer-name t)
      result))

    (defun my/helm-org-refile-read-location (tbl)
      (setq my/helm-org-refile-locations tbl)
      (helm
       (list
        ;; (helm-build-sync-source "Today's tasks"
        ;;   :candidates (mapcar (lambda (a) (cons (car a) a))
        ;;                       (my/org-get-todays-items-as-refile-candidates))
        ;;   :action '(("Select" . identity)
        ;;             ("Clock in and track" . my/helm-org-clock-in-and-track-from-refile)
        ;;             ("Draw index card" . my/helm-org-prepare-index-card-for-subtree))
        ;;   :history 'org-refile-history)
        (helm-build-sync-source "Refile targets"
          :candidates (mapcar (lambda (a) (cons (car a) a)) tbl)
          :action '(("Select" . identity)
                    ("Clock in and track" . my/helm-org-clock-in-and-track-from-refile)
                    ("Draw index card" . my/helm-org-prepare-index-card-for-subtree))
          :history 'org-refile-history)
        (helm-build-dummy-source "Create task"
          :action (helm-make-actions
                   "Create task"
                   'my/helm-org-create-task)))))

    (defun my/org-refile-get-location (&optional prompt default-buffer new-nodes no-exclude)
      "Prompt the user for a refile location, using PROMPT.
    PROMPT should not be suffixed with a colon and a space, because
    this function appends the default value from
    `org-refile-history' automatically, if that is not empty.
    When NO-EXCLUDE is set, do not exclude headlines in the current subtree,
    this is used for the GOTO interface."
      (let ((org-refile-targets org-refile-targets)
            (org-refile-use-outline-path org-refile-use-outline-path)
            excluded-entries)
        (when (and (derived-mode-p 'org-mode)
                   (not org-refile-use-cache)
                   (not no-exclude))
          (org-map-tree
           (lambda()
             (setq excluded-entries
                   (append excluded-entries (list (org-get-heading t t)))))))
        (setq org-refile-target-table
              (org-refile-get-targets default-buffer excluded-entries)))
      (unless org-refile-target-table
        (user-error "No refile targets"))
      (let* ((cbuf (current-buffer))
             (partial-completion-mode nil)
             (cfn (buffer-file-name (buffer-base-buffer cbuf)))
             (cfunc (if (and org-refile-use-outline-path
                             org-outline-path-complete-in-steps)
                        'org-olpath-completing-read
                      'org-icompleting-read))
             (extra (if org-refile-use-outline-path "/" ""))
             (cbnex (concat (buffer-name) extra))
             (filename (and cfn (expand-file-name cfn)))
             (tbl (mapcar
                   (lambda (x)
                     (if (and (not (member org-refile-use-outline-path
                                           '(file full-file-path)))
                              (not (equal filename (nth 1 x))))
                         (cons (concat (car x) extra " ("
                                       (file-name-nondirectory (nth 1 x)) ")")
                               (cdr x))
                       (cons (concat (car x) extra) (cdr x))))
                   org-refile-target-table))
             (completion-ignore-case t)
             cdef
             (prompt (concat prompt
                             (or (and (car org-refile-history)
                                      (concat " (default " (car org-refile-history) ")"))
                                 (and (assoc cbnex tbl) (setq cdef cbnex)
                                      (concat " (default " cbnex ")"))) ": "))
             pa answ parent-target child parent old-hist)
        (setq old-hist org-refile-history)
        ;; Use Helm's sources instead
        (setq answ (my/helm-org-refile-read-location tbl))
        (cond
         ((and (stringp answ)
               (setq pa (org-refile--get-location answ tbl)))
          (org-refile-check-position pa)
          (when (or (not org-refile-history)
                    (not (eq old-hist org-refile-history))
                    (not (equal (car pa) (car org-refile-history))))
            (setq org-refile-history
                  (cons (car pa) (if (assoc (car org-refile-history) tbl)
                                     org-refile-history
                                   (cdr org-refile-history))))
            (if (equal (car org-refile-history) (nth 1 org-refile-history))
                (pop org-refile-history)))
          (setq my/org-refile-last-location pa)
          pa)
         ((and (stringp answ) (string-match "\\`\\(.*\\)/\\([^/]+\\)\\'" answ))
          (setq parent (match-string 1 answ)
                child (match-string 2 answ))
          (setq parent-target (org-refile--get-location parent tbl))
          (when (and parent-target
                     (or (eq new-nodes t)
                         (and (eq new-nodes 'confirm)
                              (y-or-n-p (format "Create new node \"%s\"? "
                                                child)))))
            (org-refile-new-child parent-target child)))
         ((listp answ) answ) ;; Sacha: Helm returned a refile location
         ((not (equal answ t))
          (user-error "Invalid target location")))))

    (fset 'org-refile-get-location 'my/org-refile-get-location)
#+END_SRC

Hooray! Now =C-u C-c C-w= (=org-refile=) also lets me use =TAB= or
=F2= to select the alternative action of quickly clocking in on a
task. Mwahaha.

I think I'm getting the hang of tweaking Helm. Yay!

*** TODO DISABLED Frequently-accessed files

Collision with  =guide-key=

Registers allow you to jump to a file or other location quickly. To
jump to a register, use =C-x r j= followed by the letter of the
register. Using registers for all these file shortcuts is probably a bit of a waste since I can easily define my own keymap, but since I rarely go beyond register A anyway. Also, I might as well add shortcuts for refiling.

#+BEGIN_SRC emacs-lisp :tangle yes
(defvar my/refile-map (make-sparse-keymap))

(defmacro my/defshortcut (key file)
  `(progn
     (set-register ,key (cons 'file ,file))
     (define-key my/refile-map
       (char-to-string ,key)
       (lambda (prefix)
         (interactive "p")
         (let ((org-refile-targets '(((,file) :maxlevel . 6)))
               (current-prefix-arg (or current-prefix-arg '(4))))
           (call-interactively 'org-refile))))))

(my/defshortcut ?i "~/.emacs.d/Sacha.org")
(my/defshortcut ?o "~/personal/organizer.org")
(my/defshortcut ?s "~/personal/sewing.org")
(my/defshortcut ?b "~/personal/business.org")
(my/defshortcut ?B "~/Dropbox/books")
(my/defshortcut ?e "~/code/emacs-notes/tasks.org")
(my/defshortcut ?w "~/Dropbox/public/sharing/index.org")
(my/defshortcut ?W "~/Dropbox/public/sharing/blog.org")
(my/defshortcut ?j "~/personal/journal.org")
(my/defshortcut ?I "~/Dropbox/Inbox")
(my/defshortcut ?g "~/sachac.github.io/evil-plans/index.org")
(my/defshortcut ?c "~/code/dev/elisp-course.org")
(my/defshortcut ?C "~/personal/calendar.org")
(my/defshortcut ?l "~/dropbox/public/sharing/learning.org")
(my/defshortcut ?q "~/personal/questions.org")
#+END_SRC

#+RESULTS:
| lambda | (prefix) | (interactive p) | (let ((org-refile-targets (quote (((~/personal/questions.org) :maxlevel . 6)))) (current-prefix-arg (or current-prefix-arg (quote (4))))) (call-interactively (quote org-refile))) |

***** TEACH Jump to Org location by substring
      :PROPERTIES:
      :Effort:   1:00
      :QUANTIFIED: Emacs
      :END:
      :LOGBOOK:
      CLOCK: [2015-02-05 Thu 19:48]--[2015-02-05 Thu 20:03] =>  0:15
      :END:

   #+begin_src emacs-lisp :tangle yes
     ;; Example: (org-refile 4 nil (my/org-refile-get-location-by-substring "Other Emacs"))
     (defun my/org-refile-get-location-by-substring (regexp &optional file)
       "Return the refile location identified by REGEXP."
       (let ((org-refile-targets org-refile-targets) tbl)
         (setq org-refile-target-table (org-refile-get-targets)))
       (unless org-refile-target-table
         (user-error "No refile targets"))
       (cl-find regexp org-refile-target-table
                :test
                (lambda (a b)
                  (and
                   (string-match a (car b))
                   (or (null file)
                       (string-match file (elt b 1)))))))
     (defun my/org-refile-subtree-to (name)
       (org-refile nil nil (my/org-refile-get-location-exact name)))

      (defun my/org-refile-get-location-exact (name &optional file)
       "Return the refile location identified by NAME."
       (let ((org-refile-targets org-refile-targets) tbl)
         (setq org-refile-target-table (org-refile-get-targets)))
       (unless org-refile-target-table
         (user-error "No refile targets"))
       (cl-find name org-refile-target-table
                :test (lambda (a b)
                      (and (string-equal a (car b))
                   (or (null file)
                       (string-match file (elt b 1)))))))
     ;; Example: (my/org-clock-in-refile "Off my computer")
      (defun my/org-clock-in-refile (location &optional file)
       "Clocks into LOCATION.
     LOCATION and FILE can also be regular expressions for `my/org-refile-get-location-by-substring'."
       (interactive (list (my/org-refile-get-location)))
       (save-window-excursion
         (save-excursion
           (if (stringp location) (setq location (my/org-refile-get-location-by-substring location file)))
           (org-refile 4 nil location)
           (org-clock-in))))

      (defun my/org-finish-previous-task-and-clock-in-new-one (location &optional file)
       (interactive (list (my/org-refile-get-location)))
       (save-window-excursion
         (org-clock-goto)
         (org-todo 'done))
       (my/org-clock-in-and-track-by-name location file))

     (defun my/org-clock-in-and-track-by-name (location &optional file)
       (interactive (list (my/org-refile-get-location)))
       (save-window-excursion
         (save-excursion
           (if (stringp location) (setq location (my/org-refile-get-location-exact location file)))
           (org-refile 4 nil location)
           (my/org-clock-in-and-track))))
     (defun my/org-off-my-computer (category)
       (interactive "MCategory: ")
       (my/org-clock-in-refile "Off my computer")
       (quantified-track category))
   #+end_src

*** DONE Org Mode tables and fill-in quizzes - Latin verb conjugations in Emacs
    CLOSED: [2015-11-26 Thu 21:48]
    :PROPERTIES:
    :Effort:   0:30
    :QUANTIFIED: Emacs
    :ID:       o2b:1583ec79-b64c-4c6e-b910-80b985c94a90
    :POST_DATE: [2015-11-26 Thu 21:22]
    :POSTID:   28490
    :BLOG:     sacha
    :END:
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2015-11-26 Thu 21:48]
    CLOCK: [2015-11-26 Thu 21:11]--[2015-11-26 Thu 21:48] =>  0:37
    :END:

I've been working on memorizing Latin verb conjugations. I was looking
for a conjugation drill similar to these ones for and [[http://www.latintests.net/grammar/nouns.php][nouns]] and
[[http://www.latintests.net/grammar/pronouns1.php][pronouns]], because I liked the instant feedback and the ability to
quickly get hints. I couldn't find an online drill I liked, though, so
I made my own with Emacs and Org. (Because... why not?)

I wrote some code to allow me to take a table like this:

#+NAME: third-conjugation
| present - 1st sing. - ago / agere       | agO        |
| present - 2nd sing. - ago / agere       | agis       |
| present - 3rd sing. - ago / agere       | agit       |
| present - 1st plu. - ago / agere        | agimus     |
| present - 2nd plu. - ago / agere        | agitis     |
| present - 3rd plu. - ago / agere        | agunt      |
| imperfect - 1st sing. - ago / agere     | agEbam     |
| imperfect - 2nd sing. - ago / agere     | agEbAs     |
| imperfect - 3rd sing. - ago / agere     | agEbat     |
| imperfect - 1st plu. - ago / agere      | agEbAmus   |
| imperfect - 2nd plu. - ago / agere      | agEbAtis   |
| imperfect - 3rd plu. - ago / agere      | agEbant    |
| future - 1st sing. - ago / agere        | agam       |
| future - 2nd sing. - ago / agere        | agEs       |
| future - 3rd sing. - ago / agere        | agEt       |
| future - 1st plu. - ago / agere         | agEmus     |
| future - 2nd plu. - ago / agere         | agEtis     |
| future - 3rd plu. - ago / agere         | agent      |

I can call =my/make-fill-in-quiz= to get a quiz buffer that looks like
this. If I get stuck, =?= shows me a hint in the echo area. 

To make it easier, I've left =case-fold-search= set to =nil= so that I
don't have to match the case (uppercase vowels = macrons), but I can
set =case-fold-search= to =t= if I want to make sure I've got the
macrons in the right places.

Here's the code to display the quiz buffer.

#+begin_src emacs-lisp  :tangle yes
     (require 'widget)
     (defun my/check-widget-value (widget &rest ignore)
       "Provide visual feedback for WIDGET."
       (cond
        ((string= (widget-value widget) "?")
         ;; Asking for hint
         (message "%s" (widget-get widget :correct))
         (widget-value-set widget ""))
        ;; Use string-match to obey case-fold-search 
        ((string-match 
          (concat "^"
                  (regexp-quote (widget-get widget :correct))
                  "$")
          (widget-value widget))
         (message "Correct")
         (goto-char (widget-field-start widget))
         (goto-char (line-end-position))
         (insert "✓")
         (widget-forward 1)
         )))

   (defun my/make-fill-in-quiz (&optional quiz-table)
     "Create an fill-in quiz for the Org table at point.
The Org table's first column should have the questions and the second column 
should have the answers."
     (interactive (list (org-babel-read-table)))
     (with-current-buffer (get-buffer-create "*Quiz*")
       (kill-all-local-variables)
       (let ((inhibit-read-only t))
         (erase-buffer))
       (remove-overlays)
       (mapc (lambda (row)
               (widget-insert (car row))
               (widget-insert "\t")
               (widget-create 'editable-field
                              :size 15
                              :correct (cadr row)
                              :notify 'my/check-widget-value)
               (widget-insert "\n"))    
             quiz-table)
       (widget-create 'push-button
                      :table quiz-table
                      :notify (lambda (widget &rest ignore)
                                (my/make-fill-in-quiz (widget-get widget :table))) 
                      "Reset")
       (use-local-map widget-keymap)
       (widget-setup)
       (goto-char (point-min))
       (widget-forward 1)
       (switch-to-buffer (current-buffer))))
#+end_src  

Incidentally, I generated the table above from a larger table of Latin verb conjugations in the appendix of Wheelock's Latin, specified like this:

#+begin_src org
,#+NAME: present-indicative-active
| laudO    | moneO   | agO    | audiO   | capiO   |
| laudAs   | monEs   | agis   | audIs   | capis   |
| laudat   | monet   | agit   | audit   | capit   |
| laudAmus | monEmus | agimus | audImus | capimus |
| laudAtis | monEtis | agitis | audItis | capitis |
| laudant  | monent  | agunt  | audiunt | capiunt |

,#+NAME: imperfect-indicative-active
| laudAbam   | monEbam   | agEbam   | audiEbam   | capiEbam   |
| laudAbas   | monEbas   | agEbAs   | audiEbAs   | capiEbas   |
| laudAbat   | monEbat   | agEbat   | audiEbat   | capiEbat   |
| laudAbAmus | monEbAmus | agEbAmus | audiEbAmus | capiEbAmus |
| laudAbAtis | monEbAtis | agEbAtis | audiEbAtis | capiEbAtis |
| laudAbant  | monEbant  | agEbant  | audiEbant  | capiEbant  |

,#+NAME: future-indicative-active
| laudAbO    | monEbO    | agam   | audiam     | capiam     |
| laudAbis   | monEbis   | agEs   | audiEs     | capiEs     |
| laudAbit   | monEbit   | agEt   | audiet     | capiet     |
| laudAbimus | monEbimus | agEmus | audiEmus   | capiEmus   |
| laudAbitis | monEbitis | agEtis | audiEtis   | capiEtis   |
| laudAbunt  | monEbunt  | agent  | audient    | capient    |
#+end_src

with the code:

#+begin_src org
,#+begin_src emacs-lisp :var present=present-indicative-active :var imperfect=imperfect-indicative-active :var future=future-indicative-active
  (defun my/label-latin-with-verbs (table verbs persons tense)
    (apply 'append
           (-zip-with (lambda (row person) 
                        (-zip-with (lambda (word verb)
                                     (list word (format "%s - %s - %s" tense person verb)))
                                   row verbs))
                      table (-cycle persons))))
  (apply 'append 
         (mapcar (lambda (tense)
                   (my/label-latin-with-verbs 
                    (symbol-value tense)
                    '("laudo / laudare" "moneo / monEre" "ago / agere" "audiO / audIre" "capiO / capere")
                    '("1st sing." "2nd sing." "3rd sing." "1st plu." "2nd plu." "3rd plu.")
                    (symbol-name tense)))
                 '(present imperfect future)))

,#+end_src
#+end_src

This uses =dash.el= for the =-zip-with= and =-cycle= functions.
There's probably a much better way to process the lists, but I'm still
getting the hang of thinking properly functionally... =)

** DONE Scan ~/bin and turn the scripts into interactive commands
   CLOSED: [2015-12-14 Mon 21:24]
   :PROPERTIES:
   :Effort:   0:30
   :ID:       o2b:39fb2260-d161-4a78-929c-5443f551a5fe
   :POST_DATE: [2015-12-14 Mon 21:22]
   :POSTID:   28517
   :BLOG:     sacha
   :END:
   :LOGBOOK:
   - State "DONE"       from              [2015-12-14 Mon 21:24]
   CLOCK: [2015-12-14 Mon 20:51]--[2015-12-14 Mon 21:40] =>  0:49
   :END:

I want to automate little things on my computer so that I don't have
to look up command lines or stitch together different applications.
Many of these things make sense to turn into shell scripts. That way,
I can call them from other programs and assign keyboard shortcuts to
them. Still, I spend most of my computer time in Emacs, and I don't
want to think about whether I've defined a command in Emacs Lisp or in
a shell script. Besides, I like the way [[http://sachachua.com/blog/2014/03/emacs-basics-call-commands-name-m-x-tips-better-completion-using-ido-helm/][Helm]] lets me type parts of
commands in order to select and call them.

Emacs Lisp allows you to define a macro that results in Emacs Lisp
code. In this case, I want to define interactive functions so I can
call them with =M-x=. In case I decide to call them from Emacs Lisp,
such as =(my/shell/rotate-screen "left")=, I want to be able to pass
arguments. I'm also using [[https://github.com/magnars/dash.el][dash.el]] to provide functions like =-filter=
and =-not=, although I could rewrite this to just use the standard
Emacs Lisp functions.

Here's the code that scans a given directory for executable files and
creates interactive functions, and some code that calls it for my [[https://github.com/sachac/scripts][~/bin]] directory.

#+begin_src emacs-lisp :tangle yes
  (require 'dash)
  (require 'dash-functional)
  (defmacro my/convert-shell-scripts-to-interactive-commands (directory)
    "Make the shell scripts in DIRECTORY available as interactive commands."
    (cons 'progn
            (-map
             (lambda (filename)
               (let ((function-name (intern (concat "my/shell/" (file-name-nondirectory filename)))))
                 `(defun ,function-name (&rest args)
                    (interactive)
                    (cond
                    ((not (called-interactively-p 'any))
                     (shell-command-to-string (mapconcat 'shell-quote-argument (cons ,filename args) " ")))
                      ((region-active-p)
                     (apply 'call-process-region (point) (mark) ,filename nil (if current-prefix-arg t nil) t args))
                     (t
                      (apply 'call-process ,filename nil (if current-prefix-arg t nil) nil args))))))
             (-filter (-not #'file-directory-p)
                      (-filter #'file-executable-p (directory-files directory t))))))

  (my/convert-shell-scripts-to-interactive-commands "~/bin")
#+end_src

Let's see how that goes!

